{
  "text": " Acquired Knowledge and Skills The graduates will extend their professional profile with the ability to design, configure, implement, administer, maintain, and inovate a secure computational infrastructure, both hardware and software. They will be able to select a suitable and secure hardware and software and integrate it into existing systems while satisfying the requirements for a secure environment. They will be able to securely install and configure both SW and HW modules of existing systems, analyze potential security risks, and propose solutions for discovered weaknesses. The branch is intended for students who want to become IT and network professionals with a particular focus on security. The graduates may choose to work at any position of ICT departments, as system integrators, administrators, technicians in data centers and infrastructure providers, as network, database or webserver administrators. They can become security analysts to design and implement a secure ICT environment and analyze and solve security issues. The knowledge and skills gained in this study branch will provide them with a significant competitive advantage at the work force market. Security of complex ICT systems is one of the challeges of information society and the importance of this area for future advances of ICTS grows continuously. The aim of the Computer Security and Information Technology branch is to prepare experts in this area at the bachelor level. Students of this branch gain theoretical knowledge and practical skills needed for solving security issues of SW and HW design and operation of ICT systems. The security aspects are presented as inseparable components of the traditional ICT system administration tasks. Professional Profile The Security and Information Technology branch is intended for students who want to become experts in the area of ICT systems with the focus on their security. Graduates can work at all positions in ICT departments of companies, e.g., system integrators, computer systems administrators, data center technicians, and ICT instrastructure hosting companies, administrators of computer networks and web and database server infrastructures. They can hold positions of security analysts and technicians responsible for functioning of ICT systems and for security problems solutions."
}