{
  "text": "Acquired Knowledge and Skills Students of the specialization Software Engineering of the branch Software a Web Engineering will extend their professional profile gained within the compulsory courses with the knowledge of all phases of the software system lifecycle (analysis, design, implementation, testing, maintenance, and evolution). An important component of the study is the software project management and project team management. The focus is on team projects in which students can practice various roles in teams during the design and implementation of larger software systems. Both theoretically and practically, students get acquainted with formal notations, design methodologies (including agile programming), and supporting software tools. In team projects, students can learn various roles in a project team, when they implement large software projects. The specialization is focused on practical mastering of methods and software tools that are used during the whole software life cycle. The graduates of the specialization Software Engineering will find their jobs as programmers and team members of development teams of software companies. Also, they can be employed as administrators of large enterprise systems or in IT departments of large companies (e.g. telecommunication operators, financial institutes, automobile factories, public administration), where they can be responsible for communication with suppliers of software systems. Students of the Software Engineering specialization learn methodologies and tools used during the lifecycle of software systems, gain the knowledge of all phases of the software system lifecycle (analysis, design, implementation, testing, maintenance, and evolution). An important component of the study is the software project management and project team management. The focus is on team projects in which students can practice various roles in teams during the design and implementation of larger software systems. Both theoretically and practically, students get acquainted with formal notations, design methodologies (including agile programming), and supporting software tools. Professional Profile Graduates of the Software Engineering specialization find their jobs as programmers and team members of development teams of software companies. Also, they can be employed as developers or administrators of enterprise information systems or as software architects in ICT departments of non-IT companies (e.g., telecommunication operators, financial institutions, automobile manufactures, public administration)."
}