{
  "text": "We are pleased that you have chosen FIT as your higher education institution. This page summarizes all the important steps you need to take during the admission process. The information at this page is intended ONLY for students who apply on their own to study in English. If you are applying through Erasmus/Socrates or another exchange programme, please follow the Erasmus and Exchange students at Faculty of Information technology. How to apply for an admission to FIT - Summary: First of all, please read carefully the respective Conditions of Admission, the most important document that describes the admission rules, process, deadlines, fees, etc. Please follow Admission-related documents page. Next, fill out the application form. The application process will start January 1st, 2018, see Timetable of admission procedure for the Bachelor study programme Informatics or Timetable of admission procedure for the Master study programme Informatics. Print and sign the application form and send it by postal mail together with all the required attachments. Together with the admission committee, setup the time of the entrance test in Moodle and English interview using WebRTC. Pass successfully the entrance test and interview. After receiving the preliminary admission decision pay the tuition fee for the first semester. The best way is to use our credit card payment gateway https://app.fit.cvut.cz/poplform.php. If you cannot pay with a credit card, or if you prefer wire transfer (only recommended if you already have a Czech bank account), see the respective Directive or the Fees page. After receiving the tuition fee, FIT will send you official letter of admission, admission confirmation for the embassy, accommodation confirmation, and the study contract signed by the FIT, among other forms (DOC, PDF). Apply for your visa. After receiving the visa, arrange with the Office of Studies at FIT all the details of your arrival to FIT and registration to the programme. That’s it. While you are waiting for our decision, please start collecting the documents for the process of official recognition of your previous education in the Czech Republic (called \"nostrification\"). Bachelor programme: You will need to have your high school education recognized. This process is performed by the Czech authorities. Please obtain an official document that lists all the subjects you studied, all your results, and the number of teaching hours for each subject. For more details, see: http://skoly.praha.eu/87436_RECOGNITION-OF-FOREIGN-EDUCATION Master programme: You will need to have your Bachelor degree recognized. This process is performed at our university. You will need your diploma and your diploma supplement (or another official document that lists all your classes and results). Information about nostrification process (how to have a degree from a foreign university validated and recognised as equivalent to a Czech university degree), application form and contact is available at https://www.cvut.cz/en/validation-of-foreign-university-education-and-qualifications-nostrification. In addition, please start to inquire about the requirements for your visa. The Czech Embassy serving your country will give you all the details. See: List of Czech embassies abroad: http://www.mzv.cz/jnp/en/diplomatic_missions/missions_of_the_czech_republic_abroad_1.html Student visa information: http://www.mzv.cz/jnp/en/information_for_aliens/long_stay_visa/visa_for_a_stay_over_90_days_for_the_4.html Temporary stay for the purpose of study: http://www.mzv.cz/jnp/en/information_for_aliens/long_term_residence_permit/long_term_residence_permit_for_the_1.html"
}