{
  "text": "The Lifelong Learning Program is open to everybody, regardless of his or her age, specialization and previous education. However, you can participate in LLP only if you are not a ‚regular‘ student at FIT at the same time. Hence, to become a participant in LLP, you have to either interrupt or terminate your studies at FIT. The course of the study in the Lifelong Learning Program is governed by Act no. 111/98 Sb.[1] as amended, and by The Procedure Rules regulating the Lifelong Learning Program at CTU. A participant in LLP is not a student according to the law; hence it is impossible to issue a certificate of study to him or her. How to become a participant in LLP: You can find an application here: you need to fill out courses that you want to take as a LLP participant. You can choose any courses from the current semester; you must choose a form of study (full-time or part-time). For the part-time of the study, notice that the classes take place on Saturday (10 to 15 Saturdays per semester). The offer of all courses can be found at http://bilakniha.cvut.cz/en/f8.html. Applications are submitted for each semester separately, and a contract is concluded for each semester separately as well. For the winter semester of the academic year 2016/2017 applications can be submitted presently, even during the holidays (though notice the summer opening hours of the Office of Study). Submit your completed application no later than September 22nd, 2017 at the Office of Study to Ms. Ludmila Facer. After we have verified that the course is going to be opened in the relevant semester and that its capacity is available to LLP participants, we will send you e-mail and ask you to sign the contract and pay the tuition fee. 2 135,- CZK for each credit is charged for participation in the LLP. The tuition fee can be transferred to the account 43-4999220217 / 0100, payment identifier (VS: variabilní symbol) 85600, payment identifier (KS: konstantní symbol) 986, and specific payment identifier (SS symbol) Personal Identification Number (rodné číslo). Alternatively, the tuition fee can be paid in cash at the Office of study. Once you have paid the tuition fee, you receive a LLP participant ID card and – on request and with a refundable deposit of 200,- CZK – you can receive a CTU guest card to enter the buildings where classes take place. After completing the courses in LLP, you can apply for their recognition in the regular studies; all successfully completed courses in LLP can be recognized regardless of the actual grade awarded. For any further information, please contact ludmila.facer@fit.cvut.cz The person responsible for the content of this page: Ivana Dolejšová, Ivana.Dolejsova"
}