{
  "text": "Why Computer Science? Informatics is a scientific and engineering field for the 21st century that is, becoming more and more an integral part of all spheres of our society. ICT changes our daily lives, it opens new unimaginable possibilities, it has a dramatic impact on everything we do. The production volume and employee count of ICT industry is comparable to the automotive industry, and it grows continuously. The number of ICT professionals in the Czech Republic, Europe, and in the world is still lacking behind the needs. The demand for ICT professionals with e-skills keeps growing at a tremendous pace. See, for example, one of many studies reporting this at For Europe, a potential of more than 750,000 new ICT jobs until 2020. Simply, people with e-skills are very valued. Employees in ICT companies are very well paid. ICT companies are considered to be the best employers. It is relatively easy to create successful ICT startups. Informatics and ICT jobs is an opportunity for young talents to become successful. Why our study programme? To become a respected ICT professional requires to study theoretical background and to learn many skills. You need background in mathematics, programming skill, problem solving approach, analytical. Our study programmes cover all that. The curriculum consists of theoretical courses (such as combinatorics, automata theory, or graph theory), of computer architecture courses (such as CPU architectures, databases, operating systems, computer security), and programming and software courses. Software is what makes computers flexible and versatile. The art of programming is the skill of the future. Programming languages and frameworks abound, large programs are complex artefacts made by teams, millions of new codelines are created every single day. In general, the main goal of our study programme is to equip our graduates with a mix of theoretical knowledge and practical skills to provide the capability to solve real-world problems using engineering methods and modern ICT systems. Our graduates simply know how computers work and why they work that way and how to utilize them efficiently to improve the quality of our lives. During the studies, students can decide for one of study branches, In the English programme, we have prepared 2 Bachelor study branches: Computer Science, Web and Software Engineering specialization Software Engineering; and 4 Master study branches: Computer Systems and Networks, Computer Security, Design and Programming of Embedded Systems and Web and Software Engineering, specialization Software Engineering. The study branch curricula have been designed to reflect the latest advancements in informatics. Our degree study programmes Informatics have been designed to comply with the recommendations of international informatics curricula authorities. Thanks to the common European model of curricula in Informatics, our graduates can follow many paths after receiving their Bachelor degree. They can choose to continue with their Master’s studies at FIT or anywhere else in the Czech Republic or abroad. Similarly, after receiving the Master degree, they can continue with PhD studies at FIT or elsewhere. Or, they can start their professional career in ICT. Why CTU? FIT is the youngest faculty at the Czech Technical University in Prague, one of the oldest European technical university with more than 300 year history. And not only that, Prague is a beautiful vibrant city with rich architecture and culture heritage in the heart of Europe, see Portal of Prague. The information about Why to choose CTU is available at http://www.studyatctu.com/ctu/why-choose-ctu/."
}